/*
========UVA10696========
==========f91===========
功能：幫忙McCarthy完成遞迴的f91程式
f91：輸入一個正整數N並且依據以下的規則傳回一個正整數：
1)如果N<=100,那麼f91(N)=f91(f91(N+11))
2)如果N>=101,那麼f91(N)=N-10
*/

#include <stdio.h>
#include <stdlib.h>

int f91(int a)//f91副程式(遞迴,按照題意打就行嚕) 
{                       
  if(a<=100){           //如果N<=100 
    a=f91(f91(a+11));   //f91(N)=f91(f91(N+11))
  }else{                //如果N>=101
    a-=10;              //f91(N)=N-10
  }
                        
  return a;            //將結果回傳 
}
int main(int argc, char *argv[])
{
  int n[250000]={0};    //宣告存放數值陣列 
  int s=1,c=0;          //宣告判斷值,計數值 
  int i;                //宣告for迴圈變數 
  
  while(s!=0){
    scanf("%d",&n[c]);                       //輸入數值 
    s=n[c];                                  //將數值傳給判斷值 
    c++;                                     //計數值+1 
  }
  for(i=0;i<(c-1);i++)
  {printf("f91(%d) = %d\n",n[i],f91(n[i]));} //將數值傳給副程式並輸出 
	
  return 0;
}
