/*
=======UVA10344======
=====23 Out of 5=====
功能：輸入五個數字,在5個數字間插入一些運算子使得結果為23 
*/

#include <stdio.h>
#include <stdlib.h>

int ch23(int *a[],int *n[])//算式計算副程式 
{
  int b[4],d[5];      //宣告存放符號,數值陣列 
  int i;              //宣告for迴圈陣列
  
  for(i=0;i<5;i++){d[i]=n[i];}                               //將數值記錄存至d陣列中
  for(i=0;i<4;i++){
    b[i]=a[i];                                               //將符號記錄存至b陣列中 
    if(b[i]==2) {d[i+1]=d[i]*d[i+1]; d[i]=0; b[i]=b[i-1];}   //如果符號為"x",優先處理,當前項數值為0,當前符號項取前項符號 
  }
  for(i=0;i<4;i++){
    if(b[i]==0) d[i+1]=d[i]+d[i+1];                          //相鄰兩數相加(結果放於後項) 
    if(b[i]==1) d[i+1]=d[i]-d[i+1];                          //相鄰兩數相減(結果放於後項) 
  }
  
  return d[4];                                               //將解出來的答案回傳 
}
int q235(int *n[])//判斷是否有答案為23的組合副程式 
{
  int ans=0,p=0,s=0;                               //宣告計算值,被除數,輸出判斷值 
  int m[4]={0};                                    //宣告符號紀錄陣列 
  int i,j;                                         //宣告for迴圈陣列 
  
  for(i=0;i<256;i++){                              //============================
    p=i;                                           //符號演算,紀錄符號至陣列0~256=>0000~3333(4進制)
    for(j=0;j<4;j++){m[j]=p%4; p=p/4;}             //============================
    ans=ch23(m,n);                                 //計算 
    if(ans==23) {s=1; break;}                      //如果算式算出後答案為23,就跳出迴圈,s=1 
  }
  
  return s;                                        //將判斷結果回傳 
}
int main(int argc, char *argv[])
{
  int a[5]={0},n[25][5];  //宣告判斷值陣列,五數陣列 
  int c=0,s=0;            //宣告計數值,判斷值 
  int i;                  //宣告for迴圈陣列 
  
  for(i=0;i<5;i++){a[i]=1;}                                               //將判斷值陣列全設為1 
  while((a[0]!=0)&(a[1]!=0)&(a[2]!=0)&(a[3]!=0)&(a[4]!=0)){
    scanf("%d %d %d %d %d",&n[c][0],&n[c][1],&n[c][2],&n[c][3],&n[c][4]); //輸入5個數字 
    for(i=0;i<5;i++){a[i]=n[c][i];}                                       //將數字傳給判斷陣列 
    c++;                                                                  //計數值+1 
  }
  for(i=0;i<(c-1);i++){
    s=q235(n[i]);                                                         //將五數陣列輸入副程式 
    if(s==1) printf("Possible\n");                                        //若有答案為23的組合就輸出Possible 
    else printf("Impossible\n");                                          //如果沒有,輸出Impossible
  }
  
  system("PAUSE");	
  return 0;
}
