/*
===========UVA10019==========
===Funny Encryption Method===
功能：墨西哥蒙特瑞技術研究學院所發明的數值加密演算法
Steps : Example
1) 假設令N = M = 265為欲加密的數字
2) 把N視為十進位數值，令X1=265(十進制)
3) 把X1由十進制轉為二進制，故X1=100001001(二進制)
4) 針對以二進制表示的X1計算共有幾個1，X1=100001001共有3個1，即令B1=3
5) 把N視為十六進位數值，令X2=265(十六進制)
6) 把X2由十六進制轉為二進制，故X2=1001100101(二進制)
7) 針對以二進制表示的X2計算共有幾個1，X2=1001100101共有5個1，即令B2=5
8) 最後的編碼為 M xor (b1*b2) M xor (3*5) = 262
*/

#include <stdio.h>
#include <stdlib.h>

int b[20],h[20];
int b1=0,b2=0;

int hex(int a)//將十六進位轉二進位副程式
{
  int s[10];         //宣告存放十位數數值陣列 
  int p=0,x=0,c=0;   //宣告被除數,(計算用),計數值
  int i;             //宣告for迴圈陣列
  x=a;               //將原數傳給x
  while(x!=0){
    p=x/10; s[c]=x%10; x=p; c++;      //被除數=x/10,將餘數記錄到陣列內,p的值傳給x,計數值+1
  }
  for(i=0;i<c;i++){
    if(s[i]==0){h[(i*4)+3]=0; h[(i*4)+2]=0; h[(i*4)+1]=0; h[(i*4)]=0;}//如果s=0,h=0000 
    if(s[i]==1){h[(i*4)+3]=0; h[(i*4)+2]=0; h[(i*4)+1]=0; h[(i*4)]=1;}//如果s=1,h=0001
    if(s[i]==2){h[(i*4)+3]=0; h[(i*4)+2]=0; h[(i*4)+1]=1; h[(i*4)]=0;}//如果s=2,h=0010
    if(s[i]==3){h[(i*4)+3]=0; h[(i*4)+2]=0; h[(i*4)+1]=1; h[(i*4)]=1;}//如果s=3,h=0011
    if(s[i]==4){h[(i*4)+3]=0; h[(i*4)+2]=1; h[(i*4)+1]=0; h[(i*4)]=0;}//如果s=4,h=0100
    if(s[i]==5){h[(i*4)+3]=0; h[(i*4)+2]=1; h[(i*4)+1]=0; h[(i*4)]=1;}//如果s=5,h=0101
    if(s[i]==6){h[(i*4)+3]=0; h[(i*4)+2]=1; h[(i*4)+1]=1; h[(i*4)]=0;}//如果s=6,h=0110
    if(s[i]==7){h[(i*4)+3]=0; h[(i*4)+2]=1; h[(i*4)+1]=1; h[(i*4)]=1;}//如果s=7,h=0111
    if(s[i]==8){h[(i*4)+3]=1; h[(i*4)+2]=0; h[(i*4)+1]=0; h[(i*4)]=0;}//如果s=8,h=1000
    if(s[i]==9){h[(i*4)+3]=1; h[(i*4)+2]=0; h[(i*4)+1]=0; h[(i*4)]=1;}//如果s=9,h=1001
  }
  
  return c*4;
}
int bin(int a)//將十進位轉二進位副程式 
{
  int p=0,x=0,c=0;                 //宣告被除數,(計算用),計數值 
  x=a;                             //將原數傳給x
  while(x!=0){
    p=x/2; b[c]=x%2; x=p; c++;     //被除數=x/2,將餘數記錄到陣列內,p的值傳給x,計數值+1 
  }
  return c;                        //將計數值回傳 
}
void method(int a)
{
  int x1=0,x2=0;  //宣告數值長度變數 
  int i;          //宣告for迴圈陣列
  
  b1=0; b2=0;                           //將計數1的變數歸0 
  x1=bin(a); x2=hex(a);                 //將十進位轉成2進位(x1),十六進位轉成2進位(x2) 
  for(i=0;i<x1;i++){if(b[i]==1) b1++;}  //紀錄二進位1的個數 
  for(i=0;i<x2;i++){if(h[i]==1) b2++;}  //紀錄16進位1的個數 
  
}
int main(int argc, char *argv[])
{
  int n[1000]={0};      //宣告欲加密陣列 
  int a=0;              //宣告個數陣列 
  int i;                //宣告for迴圈陣列 
  
  scanf("%d",&a);                                          //輸入欲加密數值個數 
  for(i=0;i<a;i++){scanf("%d",&n[i]);}                     //輸入欲加密數值 
  for(i=0;i<a;i++){method(n[i]); printf("%d %d\n",b1,b2);} //將數值傳給副程式,並將b1,b2輸出 
	
  return 0;
}
