/*
=======UVA00151=======
=====Power Crisis=====
功能：將一串數值轉成文字書寫 
*/

#include <stdio.h>
#include <stdlib.h>

void power(int a)//計算最小停電間隔數值副程式 
{
  int w[100]={0},x[100]={0};  //宣告區域數陣列,停電順序陣列 
  int i,j;                    //宣告for迴圈變數
  int s=1,c=0,d=1,ans=0;      //宣告檢測值,計數值,陣列旗標,最小停電值 
  
  for(i=0;i<a;i++){w[i]=i+1;}                   //將1~a的數值填入 
  x[0]=w[0];                                    //將1設為優先停電區域 
  
  for(i=1;i<=200;i++)                           //因若有98區,最小停電數值為113(>98),故i的最大值設200 
  {  while(s<a){
      if(w[d]!=0) c++;                          //如果此區域未被斷電,計數值+1 
      if(c==i) {x[s]=w[d]; w[d]=0; c=0; s++;}   //如果計數值=停電值,將區域寫入停電順序,區域值=0,計數值=0,檢測值+1 
      if(d>=a) d=0;                             //如果旗標超過區域個數值,旗標歸0 
      d++;                                      //旗標+1 
     }
     //=======回復初始值========= 
     for(j=0;j<a;j++){w[j]=j+1;}
     x[0]=w[0]; s=1; c=0; d=1;
     //==========================
     if(x[a-1]==13) break;                      //如果第13區為最後停電區域,跳出迴圈 
  }
  ans=i;                                        //將最小停電值傳給ans 
  printf("%d\n",ans);                           //輸出最小停電值
}
int main(int argc, char *argv[])
{
  int n[100]={0};  //宣告區域個數陣列 
  int s=1,c=0;     //宣告檢測值,計數值 
  int i;           //宣告for迴圈變數 
  
  while(s!=0){
    scanf("%d",&n[c]);                  //輸入區域個數
    s=n[c];                             //將輸入值傳給檢測值 
    c++;                                //計數值+1 
  }
  for(i=0;i<(c-1);i++)
  {power(n[i]);}                        //將區域個數傳給副程式 

  //system("PAUSE");	
  return 0;
}
